let itemsContainer = document.getElementById('itemsContainer');
let items = [
    
    // 05/04/2022
    {
        ques: 'পরমাণু সম্পর্কে কখন ধারণা দেওয়া হয়?',
        ans: '৫০০-৬০০ খ্রীঃ পূর্বাব্দে।',
    },
    {
        ques: 'কে পরমাণু সম্পর্কে প্রথম ধারণা দেন?',
        ans: 'গ্রিক দার্শনিক ডেমোক্রিটাস।',
    },
    {
        ques: 'ডেমোক্রিটাস এর মতবাদটি কী?',
        ans: 'পরমাণু অতিক্ষুদ্র কণা দিয়ে গঠিত এবং অবিভাজ্য।',
    },
    {
        ques: 'ডেমোক্রিটাস পরমাণুকে কী নাম দেন?',
        ans: 'এটম।',
    },
    {
        ques: 'নিউক্লিয়াস ও ইলেকট্রনের অবস্থান কোথায়?',
        ans: 'বিজ্ঞানি রাদারফোর্ড স্বর্ণপাত পরিক্ষার মাধ্যমে প্রমাণ করেন যে পরমাণুর কেন্দ্রে থাকে নিউক্লিয়াস ও বহিস্তরে থাকে ইলেকট্রন।',
    },
    {
        ques: 'পরমাণু কী?',
        ans: 'মৌলিক পদার্থের ক্ষুদ্রতম কণার নাম পরমাণু। যা স্বাধীনভাবে চলাচল করতে পারে না তবে রাসায়নিক বিক্রিয়ায় অংশগ্রহণ করতে পারে।',
    },
    {
        ques: 'পরমাণুতে কতগুলো মৌলিক কণিকা থাকে?',
        ans: 'প্রায় ২০০।',
    },
    {
        ques: 'মূল কণিকা কী?',
        ans: 'যে সকল নিরতিশয় ক্ষুদ্র কীনকা দ্বারা পরমাণু গঠিত তাদেরকে মূল কণিকা বলে।',
    },
    {
        ques: 'মূল কণিকা কয় প্রকার?',
        ans: 'মূল কণিকা প্রধাণত তিন প্রকার। যথা: <br>১) স্থায়ী মূল কণিকা। <br>২) অস্থায়ী মূল কণিকা। <br>৩) কম্পোজিট মূল কণিকা।',
    },
    {
        ques: 'স্থায়ী মূল কণিকা কী?',
        ans: 'যে সকল কণিকা পরমাণুতে স্থায়ীভাবে বিদ্যমান তাদের স্থায়ী মূল কণিকা বলে।',
    },
    {
        ques: 'স্থায়ী মূল কণিকা কয়টি?',
        ans: 'স্থায়ী মূল কণিকা তিনটি। যথা: <br>১) ইলেকট্রন। <br>২) প্রোটন। <br>৩) নিউট্রন।',
    },
    {
        ques: 'কোন মৌলের নিউট্রন সংখ্যা নেই?',
        ans: 'সব মৌলেরই ইলেকট্রন, প্রোটন ও নিউট্রন সংখ্যা বিদ্যমান। শুধুমাত্র হাইড্রোজেন ব্যাতিক্রম যার নিউট্রন সংখ্যা নেই।',
    },
    {
        ques: 'অস্থায়ী মূল কণিকা কী?',
        ans: 'যে সকল কণিকা পরমাণুতে অল্প সময়ের জন্য বিদ্যমান থাকে তাকে অস্থায়ী মূল কণিকা বলে।',
    },
    {
        ques: 'পরমাণুতে অস্থায়ী মূল কণিকার সংখ্যা কত?',
        ans: '১০০ টি। যেমন: নিউট্রিনো, অ্যান্টি নিউট্রিনো, পজিট্রন, মশেন ইত্যাদি।',
    },
    {
        ques: 'কম্পোজিট মূল কণিকা কী?',
        ans: 'স্থায়ী ও অস্থায়ী মূল কণিকা ব্যাতিত পরমাণুতে আরো একধরণের ভারী কণা বিদ্যমান। এদেরকেই কম্পোজিট মূল কণিকা বলে। যেমন: আলফা কণিকা(হিলিয়ম নিউক্লিয়াস), গামা রশ্মি ইত্যাদি।',
    },
    {
        ques: 'আইসোটোপ কী?',
        ans: 'যেসব মৌলের পারমাণবিক সংখ্যা একই তবে ভর সংখ্যা ভিন্ন তাদেরকে পরস্পরের আইসোটোপ বলে।',
    },
    // {
    //     ques: '',
    //     ans: '',
    // },
]



items.forEach((e) => {
    let ques = e.ques
    let ans = e.ans
    itemsContainer.insertAdjacentHTML("beforeend",`<div class="quesWrapper bg-accent grid">
    <div class="fs-600 ff-sans-cond text-yellow flex">QUES:<span class="ques text-dark">${ques}</span></div>
    <div class="fs-500 ff-sans-cond text-yellow flex">ANS:<span class="ans text-dark">${ans}</span></div>
    </div>`)
})