let itemsContainer = document.getElementById('itemsContainer');
let items = [
    {
        ques: 'কোন কোন মৌলের আইসোটোপ নেই?',
        ans: 'সোডিয়াম ও গুল্ড।',
        date: '07/04/2022',
    },
    {
        ques: 'আইসোবার কী?',
        ans: 'যেসব মৌলের ভরসংখ্যা একই তবে পারমাণবিক সংখ্যা ভিন্ন তাদেরকে একে অপরের আইসোবার বলে। যেমন: <br><br>⁴⁰₁₈Ar এবং ⁴⁰₂₀Ca  পরস্পরের আইসোবার।',
        date: '07/04/2022',
    },
    {
        ques: 'আইসোটোন কী?',
        ans: 'যেসব মৌলের পারমাণবিক সংখ্যা ও পারমাণবিক ভর ভিন্ন তবে নিউট্রন সংখ্যা সমান তাকে আইসোটোন বলে। যেমন: <br><br>¹⁴₆C এবং ¹⁶₈O পরস্পরের আইসোটোন।',
        date: '07/04/2022',
    },
    {
        ques: 'পারমাণবিক সংখ্যা কী?',
        ans: 'কোন মৌলের নিউক্লিয়াসে উপস্থিত প্রোটন সংখ্যাকে ঐ মৌলের পারমাণবিক সংখ্যা বলে।',
        date: '07/04/2022',
    },
    {
        ques: 'পারমাণবিক ভর সংখ্যা কী?',
        ans: 'কোন মৌলের নিউক্লিয়াসে উপস্থিত প্রোটন এবং নিউট্রন সংখ্যার যোগফলকে পারমাণবিক ভর সংখ্যা বলে। পারমাণবিক ভরকে দ্বারা প্রকাশ করা হয়। পর্যায় সারণিতে মৌলের বাম পাশে উপরের দিকে এর অবস্থান।',
        date: '07/04/2022',
    },
    {
        ques: '১-২০ নং মৌলের পারমাণবিক ভর সংখ্যা নির্ণয়ের পদ্ধতি কী?',
        ans: '১)জোড় সংখ্যার মৌলগুলোর পারমাণবিক সংখ্যাকে দ্বিগুন করলেই মৌলের পারমাণবিক ভর সংখ্যা পাওয়া যায়।<br><br>২)বিজোড় সংখ্যার মৌলগুলোর পারমাণবিক সংখ্যাকে দ্বিগুণ করে তার সাথে এক যোগ করলেই মৌলের পারমাণবিক সংখ্যা পাওয়া যায়।<br><br> বিঃদ্রঃ কিছু ব্যাতিক্রমও রয়েছে।',
        date: '07/04/2022',
    },
    
    // 05/04/2022
    {
        ques: 'পরমাণু সম্পর্কে কখন ধারণা দেওয়া হয়?',
        ans: '৫০০-৬০০ খ্রীঃ পূর্বাব্দে।',
        date: '05/04/2022',
    },
    {
        ques: 'কে পরমাণু সম্পর্কে প্রথম ধারণা দেন?',
        ans: 'গ্রিক দার্শনিক ডেমোক্রিটাস।',
        date: '05/04/2022',
    },
    {
        ques: 'ডেমোক্রিটাস এর মতবাদটি কী?',
        ans: 'পরমাণু অতিক্ষুদ্র কণা দিয়ে গঠিত এবং অবিভাজ্য।',
        date: '05/04/2022',
    },
    {
        ques: 'ডেমোক্রিটাস পরমাণুকে কী নাম দেন?',
        ans: 'এটম।',
        date: '05/04/2022',
    },
    {
        ques: 'নিউক্লিয়াস ও ইলেকট্রনের অবস্থান কোথায়?',
        ans: 'বিজ্ঞানি রাদারফোর্ড স্বর্ণপাত পরিক্ষার মাধ্যমে প্রমাণ করেন যে পরমাণুর কেন্দ্রে থাকে নিউক্লিয়াস ও বহিস্তরে থাকে ইলেকট্রন।',
        date: '05/04/2022',
    },
    {
        ques: 'পরমাণু কী?',
        ans: 'মৌলিক পদার্থের ক্ষুদ্রতম কণার নাম পরমাণু। যা স্বাধীনভাবে চলাচল করতে পারে না তবে রাসায়নিক বিক্রিয়ায় অংশগ্রহণ করতে পারে।',
        date: '05/04/2022',
    },
    {
        ques: 'পরমাণুতে কতগুলো মৌলিক কণিকা থাকে?',
        ans: 'প্রায় ২০০।',
        date: '05/04/2022',
    },
    {
        ques: 'মূল কণিকা কী?',
        ans: 'যে সকল নিরতিশয় ক্ষুদ্র কীনকা দ্বারা পরমাণু গঠিত তাদেরকে মূল কণিকা বলে।',
        date: '05/04/2022',
    },
    {
        ques: 'মূল কণিকা কয় প্রকার?',
        ans: 'মূল কণিকা প্রধাণত তিন প্রকার। যথা:<br><br>১) স্থায়ী মূল কণিকা। <br>২) অস্থায়ী মূল কণিকা। <br>৩) কম্পোজিট মূল কণিকা।',
        date: '05/04/2022',
    },
    {
        ques: 'স্থায়ী মূল কণিকা কী?',
        ans: 'যে সকল কণিকা পরমাণুতে স্থায়ীভাবে বিদ্যমান তাদের স্থায়ী মূল কণিকা বলে।',
        date: '05/04/2022',
    },
    {
        ques: 'স্থায়ী মূল কণিকা কয়টি?',
        ans: 'স্থায়ী মূল কণিকা তিনটি। যথা:<br><br>১) ইলেকট্রন। <br>২) প্রোটন। <br>৩) নিউট্রন।',
        date: '05/04/2022',
    },
    {
        ques: 'কোন মৌলের নিউট্রন সংখ্যা নেই?',
        ans: 'সব মৌলেরই ইলেকট্রন, প্রোটন ও নিউট্রন সংখ্যা বিদ্যমান। শুধুমাত্র হাইড্রোজেন ব্যাতিক্রম যার নিউট্রন সংখ্যা নেই।',
        date: '05/04/2022',
    },
    {
        ques: 'অস্থায়ী মূল কণিকা কী?',
        ans: 'যে সকল কণিকা পরমাণুতে অল্প সময়ের জন্য বিদ্যমান থাকে তাকে অস্থায়ী মূল কণিকা বলে।',
        date: '05/04/2022',
    },
    {
        ques: 'পরমাণুতে অস্থায়ী মূল কণিকার সংখ্যা কত?',
        ans: '১০০ টি। যেমন:<br><br>নিউট্রিনো, অ্যান্টি নিউট্রিনো, পজিট্রন, মশেন ইত্যাদি।',
        date: '05/04/2022',
    },
    {
        ques: 'কম্পোজিট মূল কণিকা কী?',
        ans: 'স্থায়ী ও অস্থায়ী মূল কণিকা ব্যাতিত পরমাণুতে আরো একধরণের ভারী কণা বিদ্যমান। এদেরকেই কম্পোজিট মূল কণিকা বলে। যেমন:<br><br>আলফা কণিকা(হিলিয়ম নিউক্লিয়াস), গামা রশ্মি ইত্যাদি।',
        date: '05/04/2022',
    },
    {
        ques: 'আইসোটোপ কী?',
        ans: 'যেসব মৌলের পারমাণবিক সংখ্যা একই তবে ভর সংখ্যা ভিন্ন তাদেরকে পরস্পরের আইসোটোপ বলে।',
        date: '05/04/2022',
    },
    // {
    //     ques: '',
    //     ans: '',
    // },
]



items.forEach((e) => {
    let ques = e.ques
    let ans = e.ans
    let date = e.date
    itemsContainer.insertAdjacentHTML("beforeend",`<div class="quesWrapper bg-accent grid">
    <div class="date fs-200 ff-sans-cond">${date}</div>
    <div class="fs-600 ff-sans-cond text-yellow flex">QUES:<span class="ques text-dark">${ques}</span></div>
    <div class="fs-500 ff-sans-cond text-yellow flex">ANS:<span class="ans text-dark">${ans}</span></div>
    </div>`)
})


